# Color Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..Color Property
Material Class See Also
---
The color of the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Color Color { get; set; }
```

Visual Basic
---
```text
Public Property Color As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ Color {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace